class ClientChess:
    """客户端下棋功能"""

    def __init__(self, name=None):
        self.name = name

        # 此局我方棋色
        self.color = 0

        # 记录上一次双方下棋的位置
        self.me = (0, 0)
        self.you = (0, 0)

        # 二维列表表示棋盘：
        self.chess_list = [
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
            [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        ]

    def play(self):
        """
            开始匹配
            0表示匹配失败
            1表示此局执白棋
            2表示此局执黑棋
        :return:
        """
        # self.color = 0、1、2  # 确定此局黑白方
        pass

    def chess(self, row, col):
        """
            布棋，得到棋子的位置，仅允许0的位置可以下棋，用self.me和self.you分别记录敌我双方上次下棋的位置
        :param row:
        :param col:
        :return:
        """
        pass

    def cancel(self):
        """
            用self.me和self.you实现悔棋功能，注意：每局每名玩家单次只能悔棋一步，悔棋需双方同意
        :return:
        """
        pass

    def ask_for_peace(self):
        """
            求取平局
        :return:
        """
        pass

    def give_up(self):
        """
            认输
        :return:
        """
        pass
